#На вход программе подаются два целых числа aa и bb. Напишите программу, которая выводит:

a = int(input())
b = int(input())

print(a+b)
print(a-b)
print(a*b)
print(a/b)
print(a//b)
print(a%b)
print(((a**10)+(b**10))**0.1)